In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('fact_market_share.csv')

In [5]:
df.groupby(by='company').sum()

          city_code  tmv_city_crores   ms_pct
company
Atliqo     51232304         16607.85  2347.20
Britel     51232304         16607.85  3298.45
DADAFONE   51232304         16607.85  1236.74
Others     51232304         16607.85   867.79
PIO        51232304         16607.85  4249.85